Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttributeEnumerator Constructor
 Creates a new reference model object attribute enumerator instance.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModelObjectAttributeEnumerator(
	ReferenceModelObject RMO
)
Public Sub New (
	RMO As ReferenceModelObject
)
Parameters
RMO
Type: Tekla.Structures.Model.ReferenceModelObject
The reference model object from which the enumerator is created.
See Also
Reference
ReferenceModelObjectAttributeEnumerator Class
Tekla.Structures.Model.Collaboration Namespace